IDENTIFICATION DIVISION.
PROGRAM-ID. CALIBRATION.
AUTHOR. SRINIVASAN-JV.
ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
        FILE-CONTROL.
        SELECT INFILE ASSIGN TO '/uploads/Dec1a2023.txt'
        ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
    FILE SECTION.
    FD INFILE.
    01 INPUT-REC.
        05 W-INPUT              PIC X(80).
    WORKING-STORAGE SECTION.
    01 WS-WORK-VARIABLES.
        05 WS-CALIB-COUNTER     PIC 9(6) VALUE 0.
        05 WS-EOF               PIC A.
        05 WS-IS-NUMERIC-FLAG   PIC A.
        05 WS-INPUT             PIC X(80).
        05 WS-COUNT             PIC 9(2) VALUE 0.
        05 WS-ACTUAL-LENGTH     PIC 9(2) VALUE 0.
        05 WS-I                 PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
    OPEN INPUT INFILE.
    PERFORM UNTIL WS-EOF = 'Y'
        READ INFILE INTO WS-INPUT
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END
        PERFORM 100-CALC-RTN
        END-READ
    END-PERFORM.
    CLOSE INFILE.
    DISPLAY 'TOTAL CALIBRATION VALUE: ' WS-CALIB-COUNTER.
    STOP RUN.
    
    100-CALC-RTN.
        INSPECT FUNCTION REVERSE(WS-INPUT) TALLYING WS-COUNT FOR LEADING SPACE
        SUBTRACT WS-COUNT FROM FUNCTION LENGTH(WS-INPUT) GIVING WS-ACTUAL-LENGTH
        PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > WS-ACTUAL-LENGTH OR WS-IS-NUMERIC-FLAG = 'Y'
        IF WS-INPUT(WS-I:1) = '1' OR '2' OR '3' OR '4' OR '5' OR '6' OR '7' OR '8' OR '9' OR '0'
            COMPUTE WS-CALIB-COUNTER = WS-CALIB-COUNTER + (FUNCTION NUMVAL(WS-INPUT(WS-I:1)) * 10)
            MOVE 'Y' TO WS-IS-NUMERIC-FLAG
        END-IF
        END-PERFORM
        MOVE ' ' TO WS-IS-NUMERIC-FLAG
        PERFORM VARYING WS-I FROM WS-ACTUAL-LENGTH BY -1 UNTIL WS-I = 0 OR WS-IS-NUMERIC-FLAG = 'Y'
        IF WS-INPUT(WS-I:1) = '1' OR '2' OR '3' OR '4' OR '5' OR '6' OR '7' OR '8' OR '9' OR '0'
            COMPUTE WS-CALIB-COUNTER = WS-CALIB-COUNTER + FUNCTION NUMVAL(WS-INPUT(WS-I:1))
            MOVE 'Y' TO WS-IS-NUMERIC-FLAG
        END-IF
        END-PERFORM
        INITIALIZE  WS-INPUT
                    WS-ACTUAL-LENGTH
                    WS-IS-NUMERIC-FLAG
                    WS-COUNT.
                    
